# AddDefinition Method (String, GeometryObject) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeLibrary..::..AddDefinition Method (String, GeometryObject)
DirectShapeLibrary Class See Also
---
Add a definition to be reused by instances. A definition is a single geometry object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void AddDefinition(
	string id,
	GeometryObject GNode
)
```

Visual Basic
---
```text
Public Sub AddDefinition ( _
	id As String, _
	GNode As GeometryObject _
)
```

Visual C++
---
```text
public:
void AddDefinition(
	String^ id,
	GeometryObject^ GNode
)
```

# ### Parameters
id
    Type: System..::..String ID of the definition to be added. Must be unique.
GNode
    Type: Autodesk.Revit.DB..::..GeometryObject Definition as a single Geometry object
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeLibrary Class
AddDefinition Overload
Autodesk.Revit.DB Namespace